Bharaths25/STM32H753xx_BareMetalCode/test_board1/Src/stm32h753_I2C_driver.c
/*
 * stm32h753_I2C_driver.c
 *
 *  Created on: Jul 22, 2024
 *      Author: Bharath
 */


#include "stm32h753_I2C_driver.h"
#include "stm32h753xx.h"


static void I2C_GenerateStartCondition(I2C_RegDef_t *pI2Cx);
static void I2C_ExecuteAddressPhaseWrite(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr);
static void I2C_ExecuteAddressPhaseRead(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr);
static void I2C_ClearAddrFlag(I2C_Handle_t *pI2CHandle);
static void I2C_MasterHandleTXEInterrupt(I2C_Handle_t *pI2CHandle);
static void I2C_MasterHandleRXNEInterrupt(I2C_Handle_t *pI2CHandle);



/*
 * Peripheral Clock setup
 */
/*****************************************************************
 * @fn          - I2C_PeriClockControl
 *
 * @brief       - This function Enables or Disables peripheral
 *                clock for the given I2C port
 *
 * @param[in]   - Base address of the I2C peripheral
 * @param[in]   - Macros: Enable or Disable
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_PeriClockControl(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
    if(EnorDi == Enable)
    {
        if(pI2Cx == I2C1)
        {
            I2C1_PCLK_EN();
        }
        else if(pI2Cx == I2C2)
        {
            I2C2_PCLK_EN();
        }
        else if(pI2Cx == I2C3)
        {
            I2C3_PCLK_EN();
        }else if(pI2Cx == I2C4)
        {
            I2C4_PCLK_EN();
        }
    }
    else
    {
        if(pI2Cx == I2C1)
        {
            I2C1_PCLK_DEN();
        }
        else if(pI2Cx == I2C2)
        {
            I2C2_PCLK_DEN();
        }
        else if(pI2Cx == I2C3)
        {
            I2C3_PCLK_DEN();
        }else if(pI2Cx == I2C4)
        {
            I2C4_PCLK_DEN();
        }
    }
}



/*
 * Init and De-Init
 */
/*****************************************************************
 * @fn	        - I2C_Init
 *
 * @brief       - This function initialize I2C peripherals
 *
 * @param[in]   - Pointer to I2C Handle structure
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_Init(I2C_Handle_t *pI2CHandle)
{
    uint32_t tempreg = 0;

    /* Enabling clock for I2C peripheral */
    I2C_PeriClockControl(pI2CHandle->pI2Cx, Enable);

    /* ACK control bit */
    tempreg |= pI2CHandle->I2C_Config.I2C_ACKControl << I2C_CR1_NACKIE;
    pI2CHandle->pI2Cx->CR1 = tempreg;

    /* CR2 FREQ filed configuration */
    tempreg = 0;
    tempreg|= RCC_GetPCLK1Value() / 1000000U;
    pI2CHandle->pI2Cx->CR2 = (tempreg & 0x3F);

    /* Programming device own address */
    tempreg = 0;
    tempreg |= pI2CHandle->I2C_Config.I2C_DeviceAddress << 1;
    tempreg |= (1 << I2C_OAR1_OA1MODE);
    pI2CHandle->pI2Cx->OAR1 = tempreg;

    /* CCR calculations */
    uint16_t ccr_value = 0;
    tempreg = 0;
    if(pI2CHandle->I2C_Config.I2C_SCLSpeed <= I2C_SCL_SPEED_SM)
    {
        /* Standard mode */
        ccr_value = (RCC_GetPCLK1Value() / (2 * pI2CHandle->I2C_Config.I2C_SCLSpeed));
        tempreg |= (ccr_value & 0xFFF);
    }
    else
    {
        /* Fast mode */
        tempreg |= (1 << 15);
        tempreg |= (pI2CHandle->I2C_Config.I2C_FMDutyCycle << 14);
        if(pI2CHandle->I2C_Config.I2C_FMDutyCycle == I2C_FM_DUTY_2)
        {
            ccr_value = (RCC_GetPCLK1Value() / (3 * pI2CHandle->I2C_Config.I2C_SCLSpeed));
        }
        else
        {
            ccr_value = (RCC_GetPCLK1Value() / (25 * pI2CHandle->I2C_Config.I2C_SCLSpeed));
        }
        tempreg |= (ccr_value & 0xFFF);
    }
    pI2CHandle->pI2Cx->CR2 = tempreg;

    /* TRISE Configuration */
    if(pI2CHandle->I2C_Config.I2C_SCLSpeed <= I2C_SCL_SPEED_SM)
    {
        /* Standard mode */
        tempreg = (RCC_GetPCLK1Value() / 1000000U) + 1;
    }
    else
    {
        /* Fast mode */
        tempreg = ( (RCC_GetPCLK1Value() * 300) / 1000000U ) + 1;
    }

    pI2CHandle->pI2Cx->TIMINGR = (tempreg & 0x3F);
}



/*****************************************************************
 * @fn          - I2C_DeInit
 *
 * @brief       - This function de-initialize I2C peripherals
 *
 * @param[in]   - Base address of the I2C peripheral
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_DeInit(I2C_RegDef_t *pI2Cx)
{
    if(pI2Cx == I2C1)
    {
        I2C1_REG_RESET();
    }
    else if(pI2Cx == I2C2)
    {
        I2C2_REG_RESET();
    }
    else if(pI2Cx == I2C3)
    {
        I2C3_REG_RESET();
    }
}


/*****************************************************************
 * @fn          - I2C_GetFlagStatus
 *
 * @brief       - This function returns if bit in register is
 *                set or not
 *
 * @param[in]   - Base address of the I2C peripheral
 * @param[in]   - Name of flag
 *
 * @return      - Flag status (True/False)
 *
 * @Note        - None
 *
 *****************************************************************/
uint8_t I2C_GetFlagStatus(I2C_RegDef_t *pI2Cx, uint32_t FlagName)
{
    if(pI2Cx->ISR & FlagName)
    {
        return FLAG_SET;
    }
    return FLAG_RESET;
}


/*****************************************************************
 * @fn          - I2C_PeripheralControl
 *
 * @brief       - This function sets I2C peripheral control
 *
 * @param[in]   - Base address of the I2C peripheral
 * @param[in]   - Enable or Disable command
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_PeripheralControl(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
    if(EnorDi == Enable)
    {
        pI2Cx->CR1 |= (1 << I2C_CR1_PE);
    }
    else
    {
        pI2Cx->CR1 &= ~(1 << I2C_CR1_PE);
    }
}


/*****************************************************************
 * @fn          - I2C_MasterSendData
 *
 * @brief       - I2C Master sends data to slaves
 *
 * @param[in]   - Pointer to I2C Handle structure
 * @param[in]   - Pointer to transmit buffer
 * @param[in]   - Length of transmit buffer
 * @param[in]   - Slave address
 * @param[in]   - State of status register
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_MasterSendData(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint32_t Length, uint8_t SlaveAddr, uint8_t Sr)
{
    /* Generating start condition */
    I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

    /* Confirming start generation is completed by checking SB flag in SR1 */
    while( ! I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_TC) );

    /* Send the address of the slave with r/nm bit set to w(0) (total 8 bits) */
    I2C_ExecuteAddressPhaseWrite(pI2CHandle->pI2Cx, SlaveAddr);

    /* Confirming address phase is completed by checking ADDR flag in SR1 */
    while( ! I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_ADDR) );

    /* Clearing the address flag according to its software sequence */
    I2C_ClearAddrFlag(pI2CHandle);

    /* Send the data until length reaches 0 value */
    while(Length > 0)
    {
        /* Waiting untill TX is set */
        while( ! I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_TXE) );
        pI2CHandle->pI2Cx->TXDR = *pTxBuffer;
        pTxBuffer++;
        Length--;
    }

