Bharaths25/STM32H753xx_BareMetalCode/test_board1/Src/stm32h753_I2C_driver.c
    /* Waiting for TXE=1 and BTF=1 before generating STOP condition */
    while( ! I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_BERR) );
    while( ! I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_TC) );

    /* Generate STOP condition and master not need to wait for the completion of stop condition */
    if(Sr == I2C_DISABLE_ISR)
    {
        I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
    }
}


/*****************************************************************
 * @fn          - I2C_MasterReceiveData
 *
 * @brief       - I2C Master receive data from slaves
 *
 * @param[in]   - Pointer to I2C Handle structure
 * @param[in]   - Pointer to receive buffer
 * @param[in]   - Length of receive buffer
 * @param[in]   - Slave address
 * @param[in]   - State of status register
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_MasterReceiveData(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint32_t Length, uint8_t SlaveAddr, uint8_t Sr)
{
    /* Generating start condition */
    I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

    /* Confirming start generation is completed by checking SB flag in SR1 */
    while( ! I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_TC) );

    /* Send the address of the slave with r/nm bit set to w(0) (total 8 bits) */
    I2C_ExecuteAddressPhaseRead(pI2CHandle->pI2Cx, SlaveAddr);

    /* Confirming address phase is completed by checking ADDR flag in SR1 */
    while( ! I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_ADDR) );

    /* Procedure to read only 1 byte from slave */
    if(Length == 1)
    {
        /* Disable acknowledgment */
        I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_DISABLE);

        /* Clear address flag */
        I2C_ClearAddrFlag(pI2CHandle);

        /* Wait until RXNE becomes 1 */
        while( ! I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_RXNE) );

        /* Generate STOP condition and master not need to wait for the completion of stop condition */
        if(Sr == I2C_DISABLE_ISR)
        {
            I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
        }

        /* Read the data into buffer */
        *pRxBuffer = pI2CHandle->pI2Cx->RXDR;
    }

    if(Length > 1)
    {
        /* Clear address flag */
        I2C_ClearAddrFlag(pI2CHandle);

        /* Read the data into buffer until length becomes 0 */
        for(uint32_t i = Length; i > 0; i--)
        {
            /* Wait until RXNE becomes 1 */
            while( ! I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_RXNE) );

            /* If last 2 bits are remaining */
            if(i == 2)
            {
                /* Clear the ACK bit */
                I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_DISABLE);

                /* Generate STOP condition and master not need to wait for the completion of stop condition */
                if(Sr == I2C_DISABLE_ISR)
                {
                    I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
                }
            }

            /* Read the data from data register in to the buffer */
            *pRxBuffer = pI2CHandle->pI2Cx->RXDR;

            /* Increment the buffer address */
            pRxBuffer++;

        }
    }

    /* Re-Enable ACK */
    if(pI2CHandle->I2C_Config.I2C_ACKControl == I2C_ACK_ENABLE)
    {
        I2C_ManageAcking(pI2CHandle->pI2Cx, I2C_ACK_ENABLE);
    }
}


/*****************************************************************
 * @fn          - I2C_MasterSendDataInterruptMode
 *
 * @brief       - This function sends data over I2C
 *                peripheral in Interrupt mode
 *
 * @param[in]   - Pointer to I2C Handle structure
 * @param[in]   - Pointer to transmit buffer
 * @param[in]   - Length of transmit buffer
 * @param[in]   - Slave address
 * @param[in]   - State of status register
 *
 * @return      - Tx State
 *
 * @Note        - None
 *
 *****************************************************************/
uint8_t I2C_MasterSendDataInterruptMode(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint32_t Length, uint8_t SlaveAddr, uint8_t Sr)
{
    uint8_t busystate = pI2CHandle->TxRxState;

    if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
    {
        pI2CHandle->pTxBuffer = pTxBuffer;
        pI2CHandle->TxLen = Length;
        pI2CHandle->TxRxState = I2C_BUSY_IN_TX;
        pI2CHandle->DevAddr = SlaveAddr;
        pI2CHandle->Sr = Sr;

        /* Generating start condition */
        I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

        /* Enable ITBUFEN Control Bit */
        pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR1_ERRIE);

        /* Enable ITEVTEN Control Bit */
        pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR1_TCIE);

        /* Enable ITERREN Control Bit */
        pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR1_STOPIE);
    }

    return busystate;
}


/*****************************************************************
 * @fn          - I2C_MasterReceiveDataInterruptMode
 *
 * @brief       - This function receives data over I2C
 *                peripheral in Interrupt mode
 *
 * @param[in]   - Pointer to I2C Handle structure
 * @param[in]   - Pointer to receive buffer
 * @param[in]   - Length of receive buffer
 * @param[in]   - Slave address
 * @param[in]   - State of status register
 *
 * @return      - Rx State
 *
 * @Note        - None
 *
 *****************************************************************/
uint8_t I2C_MasterReceiveDataInterruptMode(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint32_t Length, uint8_t SlaveAddr, uint8_t Sr)
{

    uint8_t busystate = pI2CHandle->TxRxState;

    if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX))
    {
        pI2CHandle->pRxBuffer = pRxBuffer;
        pI2CHandle->RxLen = Length;
        pI2CHandle->TxRxState = I2C_BUSY_IN_RX;
        /* RxSize is used in the ISR code to manage the data reception */
        pI2CHandle->RxSize = Length;
        pI2CHandle->DevAddr = SlaveAddr;
        pI2CHandle->Sr = Sr;

        /* Generating start condition */
        I2C_GenerateStartCondition(pI2CHandle->pI2Cx);

        /* Enable ITBUFEN Control Bit */
        pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR1_ERRIE);

        /* Enable ITEVTEN Control Bit */
        pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR1_TCIE);

