Bharaths25/STM32H753xx_BareMetalCode/test_board1/Src/stm32h753_I2C_driver.c
        /* Enable ITERREN Control Bit */
        pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR1_STOPIE);
    }

    return busystate;
}


/*****************************************************************
 * @fn          - I2C_ManageAcking
 *
 * @brief       - This function manages acknowledgment bit
 *
 * @param[in]   - Base address of the I2C peripheral
 * @param[in]   - Name of flag
 *
 * @return      - Flag status (True/False)
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_ManageAcking(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
    if(EnorDi == I2C_ACK_ENABLE)
    {
        /* Enable ACK */
        pI2Cx->CR1 |= ( 1 << I2C_CR1_NACKIE);
    }
    else
    {
        /* Disable ACK */
        pI2Cx->CR1 &= ~( 1 << I2C_CR1_NACKIE);
    }
}


/*****************************************************************
 * @fn          - I2C_SlaveSendData
 *
 * @brief       - This function sends data in I2C Slave mode
 *
 * @param[in]   - Base address of the I2C peripheral
 * @param[in]   - Data
 *
 * @return      - Flag status (True/False)
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_SlaveSendData(I2C_RegDef_t *pI2Cx, uint8_t data)
{
    pI2Cx->RXDR = data;
}


/*****************************************************************
 * @fn          - I2C_SlaveReceiveData
 *
 * @brief       - This function receives data in I2C Slave mode
 *
 * @param[in]   - Base address of the I2C peripheral
 * @param[in]   - Data
 *
 * @return      - Flag status (True/False)
 *
 * @Note        - None
 *
 *****************************************************************/
uint8_t I2C_SlaveReceiveData(I2C_RegDef_t *pI2Cx)
{
    return (uint8_t)pI2Cx->RXDR;
}


/*
 * IRQ Configuration and ISR handling
 */
/*****************************************************************
 * @fn          - I2C_IRQInterruptConfig
 *
 * @brief       - This function configures interrupt
 *
 * @param[in]   - IRQ Interrupt number
 * @param[in]   - Macro: Enable/Disable
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{
    if(EnorDi == Enable)
    {
        if(IRQNumber <= 31)
        {
            /* Program ISER0 register */
            *NVIC_ISER0 |= (1 << IRQNumber);
        }
        else if(IRQNumber > 31 && IRQNumber < 64)
        {
            /* Program ISER1 register (32 to 63) */
            *NVIC_ISER1 |= (1 << (IRQNumber % 32));
        }
        else if(IRQNumber >= 64 && IRQNumber < 96)
        {
            /* Program ISER2 register (64 to 95) */
            *NVIC_ISER2 |= (1 << (IRQNumber % 64));
        }
    }
    else
    {
        if(IRQNumber <= 31)
        {
            /* Program ICER0 register */
            *NVIC_ISER0 |= (1 << IRQNumber);
        }
        else if(IRQNumber > 31 && IRQNumber < 64)
        {
            /* Program ICER1 register (32 to 63) */
            *NVIC_ISER1 |= (1 << (IRQNumber % 32));
        }
        else if(IRQNumber >= 64 && IRQNumber < 96)
        {
            /* Program ICER2 register (64 to 95) */
            *NVIC_ISER2 |= (1 << (IRQNumber % 64));
        }
    }
}


/*****************************************************************
 * @fn          - I2C_IRQPriorityConfig
 *
 * @brief       - This function configures interrupt priority
 *
 * @param[in]   - IRQ Interrupt number
 * @param[in]   - IRQ interrupt priority
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
    uint8_t iprx = IRQNumber / 4;
    uint8_t iprx_section = IRQNumber % 4;

    uint8_t shift_amount = (8 * iprx_section) + (8 - NO_PR_BITS_IMPLEMENTED);
    *(NVIC_PR1_BADDR + iprx) |= (IRQPriority << shift_amount);
}


/*****************************************************************
 * @fn          - I2C_EV_IRQHandling
 *
 * @brief       - Interrupt handling for different I2C events
 *
 * @param[in]   - Pointer to I2C Handle structure

 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_EV_IRQHandling(I2C_Handle_t *pI2CHandle)
{
    /* Interrupt handling for both master and slave mode of a device */
    uint32_t temp1, temp2, temp3;

    temp1 = pI2CHandle->pI2Cx->CR2 & (1 << I2C_CR1_ERRIE);
    temp2 = pI2CHandle->pI2Cx->CR2 & (1 << I2C_CR1_TCIE);
    temp3 = pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_RXNE);

    /* Handling for interrupt generated by SB event */
    if(temp1 && temp3)
    {
        if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX)
        {
            I2C_ExecuteAddressPhaseWrite(pI2CHandle->pI2Cx, pI2CHandle->DevAddr);
        }
        else if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX)
        {
            I2C_ExecuteAddressPhaseRead(pI2CHandle->pI2Cx, pI2CHandle->DevAddr);
        }
    }

    temp3 = pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_ADDR);

    /* Handling for interrupt generated by ADDR event */
    if(temp1 && temp3)
    {
        I2C_ClearAddrFlag(pI2CHandle);
    }

    temp3 = pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_TXIS);

    /* Handling for interrupt generated by BTF(Byte Transfer Finished) event */
    if(temp1 && temp3)
    {
        /* BTF flag is set */
        if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX)
        {
            /* TXE flag is also set */
            if(pI2CHandle->pI2Cx->ISR && (1 << I2C_ISR_STOPF))
            {
                if(pI2CHandle->TxLen == 0)
                {
                    /* Generate STOP condition */
                    if(pI2CHandle->Sr == I2C_DISABLE_ISR)
                    {
                        I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
                    }

                    /* Reset all member elements of the handle structure */
                    I2C_CloseSendData(pI2CHandle);

                    /* Notify application about transmission complete */
                    I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_TX_CMPLT);
                }
            }
        }
        else if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX)
        {
            ;
        }
    }

    temp3 = pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_STOPF);

    /* Handling for interrupt generated by STOPF event */
    if(temp1 && temp3)
    {
        /* Clear STOPF flag */
        pI2CHandle->pI2Cx->CR1 |= 0x0000;

        /* STOPF generated by master */
        I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_STOP);
    }

    temp3 = pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_TXE);

