Bharaths25/STM32H753xx_BareMetalCode/test_board1/Src/stm32h753_I2C_driver.c
    /* Handling for interrupt generated by TXE event */
    if(temp1 && temp2 && temp3)
    {
        /* Checking device mode */
        if(pI2CHandle->pI2Cx->ISR & (1 << I2C_ICR_PECCF))
        {
            if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX)
            {
                I2C_MasterHandleTXEInterrupt(pI2CHandle);
            }
        }
        else
        {
            /* Checking if slave is really in Tx mode */
            if(pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_TCR))
            {
                I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_DATA_REQ);
            }
        }
    }

    temp3 = pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_RXNE);

    /* Handling for interrupt generated by RXNE event */
    if(temp1 && temp2 && temp3)
    {
        /* Checking device mode */
        if(pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_RXNE))
        {
            /* RXNE flag is set */
            if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX)
            {
                I2C_MasterHandleRXNEInterrupt(pI2CHandle);
            }
        }
        else
        {
            /* Checking if slave is really in Rx mode */
            if(!(pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_TCR)))
            {
                I2C_ApplicationEventCallback(pI2CHandle,I2C_EV_DATA_RCV);
            }
        }
    }
}


/*****************************************************************
 * @fn          - I2C_ER_IRQHandling
 *
 * @brief       - Interrupt handling for different I2C errors
 *
 * @param[in]   - Pointer to I2C Handle structure
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_ER_IRQHandling(I2C_Handle_t *pI2CHandle)
{
    uint32_t temp1, temp2;

    /* Status of ITERREN control bit in CR2 */
    temp2 = (pI2CHandle->pI2Cx->CR2) & (1 << I2C_CR1_ERRIE);

    /* Checking for bus error */
    temp1 = (pI2CHandle->pI2Cx->ISR) & (1 << I2C_ERROR_BERR);
    if(temp1 && temp2)
    {
        /* Clear the bus error flag */
        pI2CHandle->pI2Cx->ISR &= ~(1 << I2C_ERROR_BERR);

        /* Notify application about error */
        I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_BERR);
    }

    /* Checking for arbitration lost error */
    temp1 = (pI2CHandle->pI2Cx->ISR) & (1 << I2C_ERROR_ARLO);
    if(temp1 && temp2)
    {
        /* Clear the arbitration lost error flag */
        pI2CHandle->pI2Cx->ISR &= ~(1 << I2C_ERROR_ARLO);

        /* Notify application about error */
        I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_ARLO);
    }

    /* Checking for ACK failure error */
    temp1 = (pI2CHandle->pI2Cx->ISR) & (1 << I2C_ERROR_AF);
    if(temp1 && temp2)
    {
        /* Clear the ACK failure error flag */
        pI2CHandle->pI2Cx->ISR &= ~(1 << I2C_ERROR_AF);

        /* Notify application about error */
        I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_AF);
    }

    /* Checking for Overrun/Underrun error */
    temp1 = (pI2CHandle->pI2Cx->ISR) & (1 << I2C_ERROR_OVR);
    if(temp1 && temp2)
    {
        /* Clear the Overrun/Underrun error flag */
        pI2CHandle->pI2Cx->ISR &= ~(1 << I2C_ERROR_OVR);

        /* Notify application about error */
        I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_OVR);
    }

    /* Checking for Time out error */
    temp1 = (pI2CHandle->pI2Cx->ISR) & (1 << I2C_ERROR_TIMEOUT);
    if(temp1 && temp2)
    {
        /* Clear the Time out error flag */
        pI2CHandle->pI2Cx->ISR &= ~(1 << I2C_ERROR_TIMEOUT);

        /* Notify application about error */
        I2C_ApplicationEventCallback(pI2CHandle, I2C_ISR_TIMEOUT);
    }
}


/*****************************************************************
 * @fn          - I2C_CloseReceiveData
 *
 * @brief       - Closing I2C communication when data is
 *                received
 *
 * @param[in]   - Pointer to I2C Handle structure
 *
 * @return      - None
 *
 * @Note        - Disabling all interrupts
 *
 *****************************************************************/
void I2C_CloseReceiveData(I2C_Handle_t *pI2CHandle)
{
    /* Disabling ITBUFEN Control Bit */
    pI2CHandle->pI2Cx->CR2 &= ~( 1 << I2C_CR1_TCIE);

    /* Disabling ITEVFEN Control Bit */
    pI2CHandle->pI2Cx->CR2 &= ~( 1 << I2C_CR1_ERRIE);

    pI2CHandle->TxRxState = I2C_READY;
    pI2CHandle->pRxBuffer = NULL;
    pI2CHandle->RxLen = 0;
    pI2CHandle->RxSize = 0;

    if(pI2CHandle->I2C_Config.I2C_ACKControl == I2C_ACK_ENABLE)
    {
        I2C_ManageAcking(pI2CHandle->pI2Cx,Enable);
    }

}


/*****************************************************************
 * @fn          - I2C_CloseSendData
 *
 * @brief       - Closing I2C communication when data is sent
 *
 * @param[in]   - Pointer to I2C Handle structure
 *
 * @return      - None
 *
 * @Note        - Disabling all interrupts
 *
 *****************************************************************/
void I2C_CloseSendData(I2C_Handle_t *pI2CHandle)
{
    /* Disabling ITBUFEN Control Bit */
    pI2CHandle->pI2Cx->CR2 &= ~( 1 << I2C_CR1_TCIE);

    /* Disabling ITEVFEN Control Bit */
    pI2CHandle->pI2Cx->CR2 &= ~( 1 << I2C_CR1_ERRIE);


    pI2CHandle->TxRxState = I2C_READY;
    pI2CHandle->pTxBuffer = NULL;
    pI2CHandle->TxLen = 0;
}


/*****************************************************************
 * @fn          - I2C_GenerateStopCondition
 *
 * @brief       - Generate stop condition for I2C
 *
 * @param[in]   - Base address of the I2C peripheral
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_GenerateStopCondition(I2C_RegDef_t *pI2Cx)
{
    pI2Cx->CR1 |= (1 << I2C_CR1_STOPIE);
}


/*****************************************************************
 * @fn          - I2C_SlaveEnableDisableCallbackEvents
 *
 * @brief       - Generate stop condition for I2C
 *
 * @param[in]   - Base address of the I2C peripheral
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
void I2C_SlaveEnableDisableCallbackEvents(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
    if(EnorDi == Enable)
    {
        pI2Cx->CR2 |= (1 << I2C_CR1_ERRIE);
        pI2Cx->CR2 |= (1 << I2C_CR1_TCIE);
        pI2Cx->CR2 |= (1 << I2C_CR1_STOPIE);
    }
    else
    {
        pI2Cx->CR2 &= ~(1 << I2C_CR1_TCIE);
        pI2Cx->CR2 &= ~(1 << I2C_CR1_ERRIE);
        pI2Cx->CR2 &= ~(1 << I2C_CR1_STOPIE);
    }
}


/*****************************************************************
 *               Helper functions implementation                 *
 *****************************************************************/
/*****************************************************************
 * @fn          - I2C_GenerateStartCondition
 *
 * @brief       - Generate start condition for I2C
 *
 * @param[in]   - Base address of the I2C peripheral
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
static void I2C_GenerateStartCondition(I2C_RegDef_t *pI2Cx)
{
    pI2Cx->CR1 |= (1 << I2C_CR2_START);
}


/*****************************************************************
 * @fn          - I2C_ExecuteAddressPhaseWrite
 *
 * @brief       - Send the address of the slave with r/nm
 *                bit set to r/nw(0) (total 8 bits)
 *
 * @param[in]   - Base address of the I2C peripheral
 * @param[in]   - Slave address
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
static void I2C_ExecuteAddressPhaseWrite(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr)
{
    SlaveAddr = SlaveAddr << 1;
    /* SlaveAddr is Slave address + r/nw bit=0 */
    SlaveAddr &= ~(1);
    pI2Cx->TXDR = SlaveAddr;
}


/*****************************************************************
 * @fn          - I2C_ExecuteAddressPhaseRead
 *
 * @brief       - Send the address of the slave with r/nm
 *                bit set to r/nw(1) (total 8 bits)
 *
 * @param[in]   - Base address of the I2C peripheral
 * @param[in]   - Slave address
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
static void I2C_ExecuteAddressPhaseRead(I2C_RegDef_t *pI2Cx, uint8_t SlaveAddr)
{
    SlaveAddr = SlaveAddr << 1;
    /* SlaveAddr is Slave address + r/nw bit=1 */
    SlaveAddr |= 1;
    pI2Cx->RXDR = SlaveAddr;
}


/*****************************************************************
 * @fn          - I2C_ClearAddrFlag
 *
 * @brief       - Clear address flag
 *
 * @param[in]   - Base address of the I2C peripheral
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
static void I2C_ClearAddrFlag(I2C_Handle_t *pI2CHandle)
{
    uint32_t dummy_read;

    /* Checking for device mode */
    if(pI2CHandle->pI2Cx->ISR & (1 << I2C_ISR_DIR))
    {
        /* Device is in master mode */
        if(pI2CHandle->TxRxState == I2C_BUSY_IN_RX)
        {
            if(pI2CHandle->RxSize == 1)
            {
                /* Disabling ACK */
                I2C_ManageAcking(pI2CHandle->pI2Cx, Disable);

