Bharaths25/STM32H753xx_BareMetalCode/test_board1/Src/stm32h753_I2C_driver.c
                /* Clearing ADDR flag, reading SR1 and SR2 */
                dummy_read = pI2CHandle->pI2Cx->ISR;
                dummy_read = pI2CHandle->pI2Cx->ISR;
                (void)dummy_read;
            }
        }
        else
        {
            /* Clearing ADDR flag, reading ISR */
            dummy_read = pI2CHandle->pI2Cx->ISR;
            dummy_read = pI2CHandle->pI2Cx->ISR;
            (void)dummy_read;
        }
    }
    else
    {
        /* Device is in slave mode */
        /* Clearing ADDR flag, reading ISR */
        dummy_read = pI2CHandle->pI2Cx->ISR;
        dummy_read = pI2CHandle->pI2Cx->ISR;
        (void)dummy_read;
    }
}


/*****************************************************************
 * @fn          - I2C_MasterHandleTXEInterrupt
 *
 * @brief       - Interrupt handling master TXE mode
 *
 * @param[in]   - Pointer to I2C Handle structure
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
static void I2C_MasterHandleTXEInterrupt(I2C_Handle_t *pI2CHandle)
{
    /* TXE flag is set */
    if(pI2CHandle->TxRxState == I2C_BUSY_IN_TX)
    {
        if(pI2CHandle->TxLen > 0)
        {
            /* Loading data into DR */
            pI2CHandle->pI2Cx->TXDR = *(pI2CHandle->pTxBuffer);

            /* Decrement Tx Length */
            pI2CHandle->TxLen--;

            /* Increment Tx buffer address */
            pI2CHandle->pTxBuffer++;
        }
    }
    /* DBG->Check comments */
}


/*****************************************************************
 * @fn          - I2C_MasterHandleRXNEInterrupts
 *
 * @brief       - Interrupt handling master RXNE mode
 *
 * @param[in]   - Pointer to I2C Handle structure
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
static void I2C_MasterHandleRXNEInterrupt(I2C_Handle_t *pI2CHandle)
{
    if(pI2CHandle->RxSize == 1)
    {
        *pI2CHandle->pRxBuffer = pI2CHandle->pI2Cx->RXDR;
        pI2CHandle->RxLen--;
    }

    if(pI2CHandle->RxSize > 1)
    {
        if(pI2CHandle->RxLen == 2)
        {
            /* Clearing ACK bit */
            I2C_ManageAcking(pI2CHandle->pI2Cx, Disable);
        }

        /* Reading DR */
        *pI2CHandle->pRxBuffer = pI2CHandle->pI2Cx->RXDR;
        pI2CHandle->pRxBuffer++;
        pI2CHandle->RxLen--;
    }

    if(pI2CHandle->RxLen == 0)
    {
        /* Closing I2C data reception and notifying application */

        /* Generating stop condition */
        if(pI2CHandle->Sr == I2C_DISABLE_ISR)
        {
            I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
        }

        /* Closing I2C RX */
        I2C_CloseReceiveData(pI2CHandle);

        /* Notify application about transmission complete */
        I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_RX_CMPLT);
    }
}


/*****************************************************************
 * @fn          - I2C_ApplicationEventCallback
 *
 * @brief       - Application event callback function
 *
 * @param[in]   - Handle structure
 * @param[in]   - Application event
 *
 * @return      - None
 *
 * @Note        - None
 *
 *****************************************************************/
__weak void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle, uint8_t AppEvent)
{
    /* This is a week implementation. The application may override this function. */
}

